xfire-core/src/test/org/codehaus/xfire/addressing/testcases/notify/soap12/message8.xml

<?xml version='1.0' ?>
<!-- $Id$ -->
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
 xmlns:wsa="http://www.w3.org/2005/08/addressing">
 <env:Header>
  <wsa:Action>http://example.org/action/notify</wsa:Action>
  <wsa:ReplyTo>
   <wsa:Address>http://www.w3.org/2005/08/addressing/none</wsa:Address>
   <wsa:ReferenceParameters xmlns:customer="http://example.org/customer">
    <customer:CustomerKey>Key#123456789</customer:CustomerKey>
   </wsa:ReferenceParameters>
   <wsa:Metadata>
	<definitions xmlns="http://schemas.xmlsoap.org/wsdl/">
		<!-- TBD: insert WSDL 1.1 here! -->
	</definitions>
	<definitions xmlns="http://www.w3.org/2005/08/wsdl">
		<!-- TBD: insert WSDL 2.0 here! -->
	</definitions>
   </wsa:Metadata>
  </wsa:ReplyTo>
 </env:Header>
 <env:Body>
  <m:notify xmlns:m="http://example.org/notify">Message 2</m:notify>
 </env:Body>
</env:Envelope>
